export const Courses = [
  {
    id: '01',
    name: 'Frontend',
    description:
      'Изучите основы создания пользовательских интерфейсов с использованием HTML, CSS и JavaScript. На этом курсе вы освоите передовые подходы к созданию динамичных и отзывчивых веб-страниц, а также интеграцию API для обеспечения взаимосвязи с сервером. В дополнение к изучению таких популярных фреймворков, как React и Angular, курс поможет вам углубиться в оптимизацию производительности веб-приложений и внедрение UX/UI-дизайна, делая ваши интерфейсы интуитивными и удобными для пользователей. В рамках курса также будут рассматриваться практические аспекты разработки, такие как адаптивность под различные устройства и оптимизация кода для повышения скорости загрузки и стабильности работы приложений.',
    duration: 5,
    price: 2000000,
    key: 'Javascript.svg',
    roleDescription: 'Фронтендер занимается разработкой пользовательских интерфейсов веб-приложений и сайтов. Он использует HTML, CSS и JavaScript для создания визуальных элементов, обеспечивает адаптивность интерфейсов под различные устройства и браузеры, а также интегрирует их с бэкендом через API. Фронтендеры оптимизируют производительность, тестируют и отлаживают приложения, а также работают в команде с дизайнерами и бэкенд-разработчиками для достижения общих целей проекта.',
  },
  {
    id: '02',
    name: 'Backend (Python)',
    description:
      'Освойте разработку серверной части веб-приложений с использованием Python. Изучите работу с фреймворками, такими как Django и Flask, управление базами данных с помощью SQL и ORM, создание API и обеспечение безопасности серверных приложений. Курс также включает темы, связанные с развертыванием и масштабированием веб-сервисов. Разработка серверной части позволит вам управлять данными, обрабатывать запросы и поддерживать безопасность приложений, что делает курс идеальным выбором для тех, кто хочет углубиться в бэкенд-разработку и понять внутренние механизмы работы веб-приложений.',
    duration: 6,
    price: 1500000,
    key: 'Python.svg',
    roleDescription: 'Бэкенд-разработка на Python включает создание серверной части веб-приложений. Разработчик использует фреймворки, такие как Django и Flask, для создания API и обработки запросов. Основные задачи бэкендера включают создание API для взаимодействия с фронтендом, работу с базами данных для хранения и управления данными, обработку логики приложения, включая аутентификацию и авторизацию пользователей, обеспечение безопасности и защиту от атак, а также тестирование и отладку кода для поддержания стабильности приложения. Python благодаря своей простоте и мощным библиотекам является отличным выбором для бэкенд-разработки.',
  },
  {
    id: '03',
    name: 'Введение в кибербезопасность',
    description:
      'Получите базовые знания о киберугрозах и методах защиты данных в цифровом мире. Изучите основы сетевой безопасности, шифрования, аутентификации и выявления уязвимостей. Курс также охватывает практические аспекты предотвращения атак, обеспечения безопасности систем и введение в этичный хакинг. Понимание этих принципов поможет вам поддерживать безопасность в современных цифровых экосистемах.',
    duration: 2,
    price: 2000000,
    key: 'cyber-security.png',
    roleDescription: 'Введение в кибербезопасность охватывает основные принципы защиты компьютерных систем, сетей и данных от кибератак и несанкционированного доступа. Кибербезопасность становится всё более важной в условиях растущих угроз в цифровом мире. Основные аспекты кибербезопасности включают аутентификацию пользователей, шифрование данных, защиту сетей, мониторинг активности для обнаружения инцидентов и обучение пользователей безопасным практикам. Понимание этих принципов помогает защитить информацию и поддерживать безопасность в современных цифровых экосистемах.',
  },
  {
    id: '04',
    name: 'Graphic Design',
    description:
      'Изучите основы визуальной коммуникации и научитесь создавать впечатляющие графические элементы с использованием профессиональных инструментов, таких как Adobe Photoshop, Illustrator и Figma. Курс охватывает цветовую теорию, типографику, композицию и создание брендинга. Также особое внимание уделяется разработке дизайнов для веба и печати.',
    duration: 4,
    price: 2000000,
    key: 'Photoshop.svg',
    roleDescription: 'Графический дизайн — это процесс создания визуального контента для эффективной передачи сообщений. Он включает в себя такие элементы, как типография, цветовая теория, изображения и компоновка, чтобы создавать эстетически привлекательные и функциональные дизайны. Графические дизайнеры работают над различными проектами, включая брендинг, рекламу, веб-дизайн, упаковку и печатные материалы. Основные компоненты графического дизайна включают типографику, которая отвечает за оформление текста; цветовую теорию, помогающую выбрать подходящие цветовые палитры; использование изображений для поддержки и улучшения дизайна; а также компоновку, которая определяет расположение элементов на странице для создания гармоничного и удобного восприятия. Графический дизайн играет важную роль в формировании идентичности бренда и создании эффективного визуального общения с целевой аудиторией.',
  },
  {
    id: '05',
    name: 'Motion Design',
    description:
      'Изучите основы создания анимации и визуальных эффектов для видео, веба и мобильных приложений. Научитесь работать с такими инструментами, как Adobe After Effects и Cinema 4D, для разработки динамичных видеороликов и интерактивных интерфейсов. Курс охватывает создание движущейся графики, анимацию текста, 3D-эффекты и принципы дизайна движения.',
    duration: 5,
    price: 2000000,
    key: 'After Effects.svg',
    roleDescription: 'Моушн-дизайн — это область графического дизайна, которая занимается созданием анимации и визуальных эффектов. Он сочетает в себе графику, видео и анимацию для передачи идей через движение. Основные элементы моушн-дизайна включают анимацию изображений, создание визуальных эффектов, анимированную типографику и звуковое оформление. Моушн-дизайн используется в рекламе, кино, телевидении и веб-приложениях, позволяя создавать привлекательные и запоминающиеся сообщения для аудитории.',
  },
];

export const Events = [
  {
    name: 'Хакатон',
    title: 'Встречайте Хакатон!',
    description:
      'Дорогие студенты! Это будет незабываемое приключение в мире технологий и творчества! Наш хакатон — это уникальная возможность продемонстрировать свои знания и навыки, а также воплотить самые смелые идеи в реальность. Участие в хакатоне подразумевает работу в командах, где вы сможете взаимодействовать с коллегами по направлениям фронтенда, бэкенда и графического дизайна. Вместе вы будете развивать проекты, направленные на решение актуальных задач, сталкиваться с техническими и дизайнерскими вызовами, а также обмениваться идеями. Ждём ваши идеи и уникальные подходы, которые превратят обычные концепции в интересные и функциональные проекты. Не упустите шанс проявить себя и выиграть ценные призы!',
    prizes: {
      first: '5000000',
      second: '2000000',
      third: '1000000',
    },
    startDate: '18.10.24',
    deadlineDate: '27.10.24',
    key: 'Cup.svg',
  },
];
