export const Courses = [
  {
    id: '01',
    name: 'Frontend',
    description:
      'Изучите основы создания пользовательских интерфейсов с использованием HTML, CSS и JavaScript. На этом курсе вы освоите передовые подходы к созданию динамичных и отзывчивых веб-страниц, а также интеграцию API для обеспечения взаимосвязи с сервером. В дополнение к изучению таких популярных фреймворков, как React и Angular, курс поможет вам углубиться в оптимизацию производительности веб-приложений и внедрение UX/UI-дизайна, делая ваши интерфейсы интуитивными и удобными для пользователей. В рамках курса также будут рассматриваться практические аспекты разработки, такие как адаптивность под различные устройства и оптимизация кода для повышения скорости загрузки и стабильности работы приложений.',
    duration: 5,
    price: 2000000,
    key: 'Javascript.svg',
    roleDescription: 'Фронтендер занимается разработкой пользовательских интерфейсов веб-приложений и сайтов. Он использует HTML, CSS и JavaScript для создания визуальных элементов, обеспечивает адаптивность интерфейсов под различные устройства и браузеры, а также интегрирует их с бэкендом через API. Фронтендеры оптимизируют производительность, тестируют и отлаживают приложения, а также работают в команде с дизайнерами и бэкенд-разработчиками для достижения общих целей проекта.',
  },
  {
    id: '02',
    name: 'Backend (Python)',
    description:
      'Освойте разработку серверной части веб-приложений с использованием Python. Изучите работу с фреймворками, такими как Django и Flask, управление базами данных с помощью SQL и ORM, создание API и обеспечение безопасности серверных приложений. Курс также включает темы, связанные с развертыванием и масштабированием веб-сервисов. Разработка серверной части позволит вам управлять данными, обрабатывать запросы и поддерживать безопасность приложений, что делает курс идеальным выбором для тех, кто хочет углубиться в бэкенд-разработку и понять внутренние механизмы работы веб-приложений.',
    duration: 6,
    price: 1500000,
    key: 'Python.svg',
    roleDescription: 'Бэкенд-разработка на Python включает создание серверной части веб-приложений. Разработчик использует фреймворки, такие как Django и Flask, для создания API и обработки запросов. Основные задачи бэкендера включают создание API для взаимодействия с фронтендом, работу с базами данных для хранения и управления данными, обработку логики приложения, включая аутентификацию и авторизацию пользователей, обеспечение безопасности и защиту от атак, а также тестирование и отладку кода для поддержания стабильности приложения. Python благодаря своей простоте и мощным библиотекам является отличным выбором для бэкенд-разработки.',
  },
  {
    id: '03',
    name: 'Введение в кибербезопасность',
    description:
      'Получите базовые знания о киберугрозах и методах защиты данных в цифровом мире. Изучите основы сетевой безопасности, шифрования, аутентификации и выявления уязвимостей. Курс также охватывает практические аспекты предотвращения атак, обеспечения безопасности систем и введение в этичный хакинг. Понимание этих принципов поможет вам поддерживать безопасность в современных цифровых экосистемах.',
    duration: 2,
    price: 2000000,
    key: 'cyber-security.png',
    roleDescription: 'Введение в кибербезопасность охватывает основные принципы защиты компьютерных систем, сетей и данных от кибератак и несанкционированного доступа. Кибербезопасность становится всё более важной в условиях растущих угроз в цифровом мире. Основные аспекты кибербезопасности включают аутентификацию пользователей, шифрование данных, защиту сетей, мониторинг активности для обнаружения инцидентов и обучение пользователей безопасным практикам. Понимание этих принципов помогает защитить информацию и поддерживать безопасность в современных цифровых экосистемах.',
  },
  {
    id: '04',
    name: 'Graphic Design',
    description:
      'Изучите основы визуальной коммуникации и научитесь создавать впечатляющие графические элементы с использованием профессиональных инструментов, таких как Adobe Photoshop, Illustrator и Figma. Курс охватывает цветовую теорию, типографику, композицию и создание брендинга. Также особое внимание уделяется разработке дизайнов для веба и печати.',
    duration: 4,
    price: 2000000,
    key: 'Photoshop.svg',
    roleDescription: 'Графический дизайн — это процесс создания визуального контента для эффективной передачи сообщений. Он включает в себя такие элементы, как типография, цветовая теория, изображения и компоновка, чтобы создавать эстетически привлекательные и функциональные дизайны. Графические дизайнеры работают над различными проектами, включая брендинг, рекламу, веб-дизайн, упаковку и печатные материалы. Основные компоненты графического дизайна включают типографику, которая отвечает за оформление текста; цветовую теорию, помогающую выбрать подходящие цветовые палитры; использование изображений для поддержки и улучшения дизайна; а также компоновку, которая определяет расположение элементов на странице для создания гармоничного и удобного восприятия. Графический дизайн играет важную роль в формировании идентичности бренда и создании эффективного визуального общения с целевой аудиторией.',
  },
  {
    id: '05',
    name: 'Motion Design',
    description:
      'Изучите основы создания анимации и визуальных эффектов для видео, веба и мобильных приложений. Научитесь работать с такими инструментами, как Adobe After Effects и Cinema 4D, для разработки динамичных видеороликов и интерактивных интерфейсов. Курс охватывает создание движущейся графики, анимацию текста, 3D-эффекты и принципы дизайна движения.',
    duration: 5,
    price: 2000000,
    key: 'After Effects.svg',
    roleDescription: 'Моушн-дизайн — это область графического дизайна, которая занимается созданием анимации и визуальных эффектов. Он сочетает в себе графику, видео и анимацию для передачи идей через движение. Основные элементы моушн-дизайна включают анимацию изображений, создание визуальных эффектов, анимированную типографику и звуковое оформление. Моушн-дизайн используется в рекламе, кино, телевидении и веб-приложениях, позволяя создавать привлекательные и запоминающиеся сообщения для аудитории.',
  },
];

export const Events = [
  {
    id: '01',
    name: 'Хакатон',
    title: 'Встречайте Хакатон!',
    description:
      'Дорогие студенты! Это будет незабываемое приключение в мире технологий и творчества! Наш хакатон — это уникальная возможность продемонстрировать свои знания и навыки, а также воплотить самые смелые идеи в реальность. Участие в хакатоне подразумевает работу в командах, где вы сможете взаимодействовать с коллегами по направлениям фронтенда, бэкенда и графического дизайна. Вместе вы будете развивать проекты, направленные на решение актуальных задач, сталкиваться с техническими и дизайнерскими вызовами, а также обмениваться идеями. Ждём ваши идеи и уникальные подходы, которые превратят обычные концепции в интересные и функциональные проекты. Не упустите шанс проявить себя и выиграть ценные призы!',
    startDate: '18.10.24',
    key: 'Cup.svg',
  },
  {
    id: '02',
    name: 'Tech Talk',
    title: 'Tech Talk с экспертами',
    description:
      'Приглашаем всех студентов на серию лекций Tech Talk, где опытные профессионалы поделятся своими знаниями и опытом в сфере технологий. У вас будет уникальная возможность узнать о последних тенденциях в области искусственного интеллекта, кибербезопасности и веб-разработки, а также задать вопросы и получить советы по карьере. Не пропустите шанс окунуться в мир IT и узнать больше о своей будущей профессии!',
    startDate: '25.10.24',
    key: 'Mic.svg',
  },
  {
    id: '03',
    name: 'Demo Day',
    title: 'Demo Day: Покажи свой проект!',
    description:
      'Demo Day — это возможность для студентов показать свои проекты, над которыми они работали на протяжении обучения. Приглашённые эксперты, потенциальные работодатели и ваши друзья смогут увидеть, что вы создали, и дать вам ценные советы. Этот день станет настоящим праздником для всех, кто хочет проявить свои таланты, продемонстрировать инновационные идеи и получить обратную связь. Покажите, на что вы способны!',
    startDate: '05.11.24',
    key: 'Demo.svg',
  },
  {
    id: '04',
    name: 'Networking Night',
    title: 'Networking Night: Знакомьтесь и общайтесь',
    description:
      'Networking Night — это вечер, посвящённый установлению новых профессиональных связей. Участники смогут познакомиться с выпускниками академии, действующими специалистами в области IT и другими студентами. Вы сможете узнать об их карьерных путях, задать вопросы и даже найти наставника для дальнейшего профессионального роста. Возьмите визитки и подготовьте интересные вопросы — этот вечер станет отличной возможностью для нетворкинга!',
    startDate: '12.11.24',
    key: 'Networking.svg',
  },
  {
    id: '05',
    name: 'Cybersecurity Bootcamp',
    title: 'Интенсив по кибербезопасности',
    description:
      'Приглашаем на интенсивный курс по кибербезопасности, где вы научитесь защищать данные и разрабатывать безопасные приложения. В рамках bootcamp вас ждут практические задачи, лекции от экспертов и реальные кейсы, которые помогут разобраться в основах безопасности информации. Это будет не только интересно, но и очень полезно для вашей карьеры в IT!',
    startDate: '20.11.24',
    key: 'Shield.svg',
  },
  {
    id: '06',
    name: 'UX/UI Workshop',
    title: 'Мастер-класс по UX/UI дизайну',
    description:
      'Этот мастер-класс погрузит вас в основы UX/UI дизайна и научит создавать удобные и стильные интерфейсы. Вы изучите принципы взаимодействия с пользователем, научитесь работать с прототипами и получите практические навыки в дизайне интерфейсов для мобильных приложений и веб-сайтов.',
    startDate: '28.11.24',
    key: 'Design.svg',
  },
  {
    id: '07',
    name: 'Data Science Week',
    title: 'Неделя Data Science',
    description:
      'Неделя Data Science — это отличный шанс для студентов погрузиться в мир аналитики данных. За неделю вы освоите ключевые инструменты для работы с большими данными, изучите методы машинного обучения и анализирования данных. На протяжении недели будут проведены мастер-классы, лекции и практические занятия, которые помогут вам освоить основы Data Science.',
    startDate: '03.12.24',
    key: 'Data.svg',
  },
  {
    id: '08',
    name: 'Game Development Night',
    title: 'Ночь Разработки Игр',
    description:
      'Приглашаем всех любителей игр и разработки на нашу игровую ночь, где вы сможете создавать простые игры, обмениваться идеями и получать советы от опытных разработчиков. Это отличный шанс узнать, как разрабатываются современные игры и какие инструменты и технологии используются для их создания.',
    startDate: '10.12.24',
    key: 'Game.svg',
  },
  {
    id: '09',
    name: 'Startup Pitch Day',
    title: 'Pitch Day: Представь свой стартап!',
    description:
      'Вы думаете о создании стартапа или у вас уже есть идея? Pitch Day — это событие, на котором вы сможете представить свой проект перед инвесторами, экспертами и потенциальными партнерами. Получите обратную связь, совет от профессионалов и шанс на финансирование!',
    startDate: '15.12.24',
    key: 'Pitch.svg',
  },
  {
    id: '10',
    name: 'AI Lab',
    title: 'Лаборатория Искусственного Интеллекта',
    description:
      'Загляните в будущее технологий с нашим AI Lab! Здесь вы сможете работать с нейросетями, создавать чат-ботов и исследовать возможности машинного обучения. Лаборатория станет отличным местом для всех, кто хочет узнать, как искусственный интеллект меняет мир.',
    startDate: '22.12.24',
    key: 'AI.svg',
  },
];
