export default {
  ru: {
    title: 'Узнайте, как мы готовим IT специалистов мирового уровня!',
    description: 'Приходите на бесплатную экскурсию по нашей академии и окунитесь в мир современных технологий.',
    about: 'О нас',
    events: 'Ивенты',
    contacts: 'Контакты',
    tour: 'Записаться на экскурсию',
    whyUs: 'Почему именно мы?',
    whyUsArr: [
      {
        title: 'Актуальные и практические знания',
        description: 'Наши преподаватели — это практики с реальным опытом, готовые делиться своими знаниями и навыками. Мы предлагаем дуальное образование, которое позволяет вам начать профессиональную стажировку уже в первый месяц обучения, совмещая теорию с реальной практикой для более глубокого погружения в профессию.'
      },
      {
        title: 'Сообщество единомышленников',
        description: 'Здесь вы найдете не только друзей, которые разделят ваш путь, но и опытных наставников, готовых поддержать, направить и помочь вам развить свои навыки. В этом пространстве каждый шаг – это возможность для личного роста и профессионального совершенствования.'
      },
      {
        title: 'Развитие Soft Skills',
        description: 'Для достижения поставленных целей всем специалистам необходимо прокачивать не только hard skills а также soft skills: эффективные переговоры, маркетинг и инновационные бизнес модели, финансы для IT, презентация.'
      },
      {
        title: 'Удобный формат обучения',
        description: 'Выбирайте удобное для себя время и обучайтесь по гибкому графику — три раза в неделю по 1,5 часа. Наш подход позволяет вам гармонично сочетать учебу с другими приоритетами и двигаться к своим целям в удобном темпе.'
      },
      {
        title: 'Профориентация на входе',
        description: 'Профориентация — это комплексный процесс, направленный на осознанное построение карьеры. Он помогает человеку выбрать профессиональный путь, опираясь на личный опыт, интересы, внутренние чувства и потребности. Такой подход способствует развитию карьеры, отражающей уникальные качества и стремления каждого.'
      },
      {
        title: 'Трудоустройство',
        description: 'Наши компании-партнеры уже ждут вас! С ними вы сможете начать карьеру и применить свои знания на практике, открывая для себя перспективы в ведущих организациях'
      },
    ],
    courses: [
      {

      },
    ]
  },
  uz: {},
  oz: {}
}
